Repository: trackballs/trackballs
Catalog: po/*.po
Languages: fr

source: Calibrating Joystick
fr: Calibration de la manette de jeu

source: Center joystick
fr: Centre de la manette

source: Move joystick left
fr: Gauche de la manette

source: Move joystick right
fr: Droite de la manette

source: Move joystick up
fr: Haut de la manette

source: Move joystick down
fr: Bas de la manette

source: Press any button to continue
fr: Pressez un bouton pour continuer

source: Press escape to cancel
fr: Pressez Échap. pour annuler

source: now: %d %d
fr: maintenant: %d %d

source: center: %d %d left: %d right: %d up: %d down: %d
fr: centre: %d %d gauche: %d droite: %d haut: %d bas: %d

source: Save point
fr: Point de sauvegarde

source: File
fr: Fichier

source: Edit
fr: Edition

source: Color
fr: Couleur

source: Flags
fr: Drapeaux

source: Feature
fr: Caractéristique

source: Repair
fr: Réparer

source: Move
fr: Deplacer

source: Window
fr: Fenêtre

source: View
fr: Vue

source: New
fr: Nouveau

source: Open
fr: Ouvrir

source: Close
fr: Fermer

source: Save
fr: Enregistrer

source: Exit
fr: Quitter

source: Test level
fr: Tester le niveau

source: Edit height
fr: Changer la hauteur

source: Edit color
fr: Changer la couleur

source: Edit water
fr: Changer l'eau

source: Edit velocity
fr: Changer la vélocité

source: Edit lines
fr: Changer les lignes

source: *<SPACE> Whole cell
fr: *<ESPACE> Toute la cellule

source: Upper corner
fr: Coin du haut

source: Bottom corner
fr: Coin du bas

source: Right corner
fr: Coin de droite

source: Left corner
fr: Coin de gauche

source: Center
fr: Centre

source: Raise increment
fr: Augmenter l'incrément

source: Lower increment
fr: Diminuer l'incrément

source: *<SHIFT> reversed
fr: *<SHIFT> inverser

source: *<CTRL> walls
fr: *<CTRL> murs

source: Inc. red
fr: Aj. rouge

source: Inc. green
fr: Aj. vert

source: Inc. blue
fr: Aj. bleu

source: Inc. alpha
fr: Aj. alpha

source: Ice
fr: Glace

source: Acid
fr: Acide

source: Sand
fr: Sable

source: Kill
fr: Tuer

source: Bounce
fr: Rebondir

source: No grid
fr: Pas de grille

source: Track
fr: Piste

source: Shade flat
fr: Ombrer plat

source: Spike
fr: Pic

source: Small hill
fr: Petite colline

source: Medium hill
fr: Moyenne colline

source: Large hill
fr: Grande colline

source: Huge hill
fr: Énorme colline

source: Smooth small
fr: Petite surface lisse

source: Smooth large
fr: Grande surface lisse

source: Cell cont.
fr: Continuité de hauteur

source: Water cont.
fr: Continuité de l'eau

source: Color cont.
fr: Continuité de la couleur

source: Cell center
fr: Centrer la hauteur

source: Water center
fr: Centrer l'eau

source: Color center
fr: Centrer la couleur

source: Cell round
fr: Arrondir la hauteur

source: Water round
fr: Arrondir l'eau

source: Color round
fr: Arrondir la couleur

source: Vel. round
fr: Arrondir la vélocité

source: /UP Move up
fr: /HAUT Vers le haut

source: /DOWN Move down
fr: /BAS Vers le bas

source: /LEFT Move left
fr: /GAUCHE Vers la gauche

source: /RIGHT Move right
fr: /DROITE Vers la droite

source: Shift map up
fr: Déplacer la carte vers le haut

source: Shift map down
fr: Déplacer la carte vers le bas

source: Shift map left
fr: Déplacer la carte vers la gauche

source: Shift map right
fr: Déplacer la carte vers la droite

source: Set region marker
fr: Définir le marqueur de region

source: Clear marker
fr: Effacer le marqueur

source: Copy region
fr: Copier la région

source: Paste region
fr: Coller la région

source: Editor
fr: Éditeur

source: Toolbar
fr: Barre d'outils

source: Status
fr: Statut

source: Birds's eye
fr: Oeil d'oiseaux

source: Rotate view
fr: Tourner la vue

source: Load entities
fr: Charger les entités

source: Clear entities
fr: Effacer les entités

source: Small smooth
fr: Petite surface lisse

source: Large smooth
fr: Grande surface lisse

source: Track:
fr: Piste:

source: This is the default script file for this track.
fr: Ceci est le fichier de script par défaut pour cette piste.

source: Read the documentation for the editor and look at the examples
fr: Lisez la documentation de l'éditeur et regardez les exemples

source: to learn how to customize it
fr: pour apprendre à le personnaliser

source: Enter your name here
fr: Entrez votre nom

source: Add the name of the next level here
fr: Ajoutez le nom du prochain niveau ici

source: Cell height
fr: Hauteur de la cellule

source: Cell water height
fr: Hauteur de la cellule d'eau

source: height
fr: Hauteur

source: color
fr: Couleur

source: water
fr: L'eau

source: velocity
fr: La vélocité

source: lines
fr: Lignes

source: feature
fr: Caractéristique

source: Increment: %3.2f
fr: Incrément %3.2f

source: Edit: %s
fr: Modifier: %s

source: Heights
fr: Hauteur

source: Water heights
fr: Hauteur de l'eau

source: red: %2.2f
fr: rouge: %2.2f

source: green: %2.2f
fr: vert: %2.2f

source: blue: %2.2f
fr: bleu: %2.2f

source: Lines
fr: Lignes

source: spike
fr: Pic

source: small hill
fr: Petite colline

source: medium hill
fr: Moyenne colline

source: large hill
fr: Grande colline

source: huge hill
fr: Énorme colline

source: small smooth
fr: Petite surface lisse

source: large smooth
fr: Grande surface lisse

source: Quit without saving?
fr: Quitter sans enregistrer ?

source: Yes
fr: Oui

source: No
fr: Non

source: Save map?
fr: Enregistrer la carte ?

source: Saving
fr: Enregistre

source: Close without saving?
fr: Quitter sans enregistrer ?

source: Name of map
fr: Nom de la carte

source: Cancel
fr: Annuler

source: Open map
fr: Ouvrir une carte

source: High Score
fr: Score Élevé

source: You got %d points
fr: Vous avez %d points

source: Enter your name: %s
fr: Entrez votre nom: %s

source: John Doe
fr: Jean Dupont

source: Framerate:
fr: Taux d'images:

source: unknown
fr: inconnu

source: ms/Frame:
fr: ms/Image:

source: Your marble:
fr: Votre boule :

source: Steer this with your mouse, numpad or arrows.
fr: Déplacez-la avec la souris, le pave numérique ou les flèches.

source: Left mouse or spacebar is jump.
fr: Le bouton gauche de la souris ou espace pour sauter.

source: Shift gives top speed when using keyboard.
fr: Maj donne de la vitesse quand on utilise le clavier.

source: Mr Black:
fr: M. Black:

source: Your enemy. Defeat with Modpill - Spike.
fr: Votre ennemi. Détruisez-le avec une pilule piquante.

source: Modpill Speed:
fr: Pilule de vitesse:

source: Makes you go faster for short period of time.
fr: Augmente votre vitesse de déplacement temporairement.

source: Modpill Spikes:
fr: Pilule piquante:

source: Weapon against Mr Black and grip for icy terrain.
fr: Arme contre M. Black et utile sur terrain glissant.

source: Modpill Freeze:
fr: Pilule de glace:

source: This will freeze you - avoid it.
fr: Celle-ci vous congèle. Évitez-la.

source: Modpill Glass:
fr: Pilule de verre:

source: Protects you from acid, but makes you more fragile.
fr: Vous protège de l'acide, mais vous rend plus fragile.

source: Modpill Nitro:
fr: Pilule de nitro:

source: Move really fast. Active nitro with second button.
fr: Activée avec le second bouton, elle permet des déplacements très rapides.

source: Switch:
fr: Interrupteur:

source: Activates/deactivates some object/element in the level.
fr: Active/désactive un objet ou élément du niveau.

source: Moving spike:
fr: Pics mouvant:

source: Obstacle to avoid.
fr: Obstacle a eviter.

source: Flag:
fr: Drapeau:

source: Collect for bonus points.
fr: Donne des points bonus.

source: Normal terrain:
fr: Terrain normal:

source: Can be of any color and is safe to move on.
fr: Peut être de diverses couleurs, et est sans danger.

source: Acid terrain:
fr: Terrain acide:

source: Will kill your marble unless you have a glass modpill.
fr: Tue votre boule a moins que vous ayez pris une pilule de verre.

source: Icy terrain:
fr: Terrain gelé:

source: Slippery terrain unless you have a spikes modpill.
fr: Terrain glissant a moins que vous ayez pris une pilule piquante.

source: Sandy terrain:
fr: Terrain ensable:

source: Soft to land on but will slow you down.
fr: Mou pour atterrir mais ralentit les déplacements.

source: Goal:
fr: But:

source: Will take you to the next level.
fr: Vous amène au niveau suivant.

source: Get here before time runs out.
fr: Allez-y avant que le temps soit écoulé.

source: Force Field:
fr: Champ de force:

source: You cannot pass this unless you switch it off.
fr: Vous ne pouvez pas passer sans le désactiver.

source: Some are lethal and some are one way.
fr: Certains sont mortels, d'autres a sens unique.

source: Spiky plant, lethal unless you have a spikes modpill.
fr: Plante hérissés, mortelle à moins que vous avez des pointes vous-même.

source: Bird:
fr: Oiseau:

source: Kills balls it flies across unless they have spikes.
fr: Tue balles il vole à travers à moins qu'ils ont des pointes.

source: Teleport:
fr: Téléporteur:

source: Will send your marble somewhere else.
fr: Il enverra votre marbre ailleurs.

source: Takes you places, sometimes with great speed.
fr: Vous amène a un autre endroit, parfois très rapidement.

source: More Help
fr: Plus d'aide

source: Back
fr: Retour

source: High Scores
fr: Scores Élevés

source: Level Set
fr: Groupe de niveaux

source: Anonymous Coward
fr: Lâche anonyme

source: Unknown track
fr: Piste inconnue

source: Author:
fr: Auteur:

source: Unknown author
fr: Auteur inconnu

source: Press spacebar to begin
fr: Pressez espace pour commencer

source: Press spacebar to continue
fr: Pressez espace pour continuer

source: Game over
fr: Perdu

source: Oops
fr: Oups

source: Paused
fr: En pause

source: Bonus level complete
fr: Niveau bonus termine

source: Level complete
fr: Niveau termine

source: You have completed the game!
fr: Vous avez termine le jeu !

source: Good luck!
fr: Bonne chance !

source: Lives
fr: Vies

source: Score
fr: Points

source: Time left
fr: Temps

source: Level bonuses
fr: Niveaux bonus

source: Lives left:
fr: Vies restantes:

source: Time left:
fr: Temps restant:

source: Difficulty:
fr: Difficulté:

source: easy
fr: facile

source: normal
fr: normale

source: hard
fr: difficile

source: Trackballs is a game similar to the classical game Marble Madness from the 80's. By steering a marble ball through a labyrinth filled with sharp spikes, pools of acid and other obstacles the player collects points. When the ball reaches the destination you continue on the next, more difficult, level - unless, of course, the time runs out. You steer the ball using the mouse and by pressing >spacebar< you can jump a short distance.
fr: Trackballs est un jeu inspire du classique Marble Madness (datant des années 80). En manoeuvrant une boule de marbre a travers un labyrinthe rempli de pics pointus, de bains d'acide et d'autres obstacles vous collectez des points. Quand la balle atteint la destination, un nouveau niveau, plus difficile, commence. Bien sûr, le temps est limite.Vous dirigez la boule avec la souris et en pressant la barre d'espace, vous pouvez lui faire réaliser de petits sauts.

source: New Game
fr: Nouvelle partie

source: Quit
fr: Quitter

source: Settings
fr: Parametres

source: Hall of Fame
fr: Meilleurs scores

source: Help
fr: Aide

source: Map Editor
fr: Éditeur de cartes

source: Usage:
fr: Utilisation:

source: [-w, -m] [-e, -l -t <level>] [-r <width>] [-s <sensitivity>]
fr: [-w, -m] [-e, -l -t <niveau>] [-r <largeur>] [-s <sensibilite>]

source: Display this usage information.
fr: Affiche ce message d'aide.

source: Start from level.
fr: Commencer à partir du niveau.

source: Run in window (Default is fullscreen)
fr: Mode fenêtre (plein écran par défaut)

source: Mute sound.
fr: Son muet.

source: Set resolution to 640, 800 or 1024
fr: Définit la résolution a 640, 800 ou 1024

source: Mouse sensitivity, default 1.0
fr: Sensibilité de la souris, 1.0 par défaut

source: Displays framerate
fr: Affiche le taux d'image

source: Prints current version number
fr: Affiche la version courante

source: Updates a map to the latest format
fr: Met a jour une carte vers le format actuel

source: Attempt to conserve memory usage
fr: Essaie de limiter l'utilisation de mémoire

source: Debug joystick status
fr: Déboguer les manettes

source: Correct for bad joysticks
fr: Pour certaines (mauvaises) manettes de jeu

source: Important keyboard shortcuts
fr: Raccourcis clavier importants:

source: Escape
fr: Échap.

source: Soft quit
fr: Quitter doucement

source: CapsLock
fr: VerrMaj

source: Unhide mouse pointer
fr: Révéler le pointeur de la souris

source: Quit the game immediately
fr: Quitter le jeu immédiatement

source: Toggle between fullscreen/windowed mode
fr: Basculer entre le mode plein écran / fenêtré

source: Kill the ball
fr: Tuer la balle

source: Unknown screen resolution of width %d
fr: Résolution d'écran inconnue de largeur %d

source: Welcome to Trackballs.
fr: Bienvenue dans Trackballs.

source: Using %s as gamedata directory.
fr: Utilise %s comme répertoire de données.

source: Speed ball
fr: Vitesse

source: Extra jump
fr: Saut supplémentaire

source: Spikes
fr: Piquante

source: Glass ball
fr: Balle de verre

source: Dizzy!
fr: Pris de vertige!

source: Freeze!
fr: Glacé!

source: Floating
fr: Flottant

source: Extra life
fr: Vie supplémentaire

source: Small ball
fr: Petite balle

source: Large ball
fr: Grande balle

source: Game Settings
fr: Paramètres de jeu

source: Is resolution %dx%dx%d ok?
fr: La résolution %dx%dx%d est-elle acceptable?

source: Is resolution Auto-%d ok?
fr: La résolution Auto-%d est-elle acceptable?

source: Ok, use this resolution
fr: Oui, utilisez cette résolution

source: No, revert to old resolution
fr: Non, revenir à l'ancienne résolution

source: Timeout in %d seconds
fr: Délai d'attente en %d secondes

source: Video
fr: Vidéo

source: Resolution
fr: Résolution

source: Test this resolution
fr: Testez cette résolution

source: Fullscreen
fr: Plein écran

source: Frame rate
fr: Taux d'images

source: Frame time
fr: Temps d'image

source: Show FPS
fr: Montrer les IPS

source: Graphics
fr: Graphismes

source: None
fr: Aucun

source: Minimalistic
fr: Minimalistes

source: Simple
fr: Simples

source: Everything
fr: Tout

source: Details
fr: Détails

source: Reflections
fr: Réflexions

source: Shadows
fr: Ombres

source: Shadow Resolution
fr: Résolution des ombres

source: Controls
fr: Contrôles

source: Use mouse
fr: Utiliser la souris

source: Sensitivity
fr: Sensibilité

source: +%d degrees
fr: +%d degrés

source: -%d degrees
fr: -%d degrés

source: Steering
fr: Direction

source: no joystick found
fr: Aucun joystick n'a été trouvé

source: Joystick:
fr: Manette de jeu:

source: Other
fr: Autre

source: Language
fr: Langage

source: Music volume
fr: Volume de la musique

source: Effects volume
fr: Volume des effets

source: Sandbox mode available
fr: Mode de contrôle disponible

source: Time Compression
fr: Compression du temps

source: Setup new game
fr: Configurer un nouveau jeu

source: Player Name
fr: Nom du joueur

source: N/A
fr: ND

source: Level
fr: Niveau

source: Difficulty
fr: Difficulté

source: Sandbox (Easy)
fr: Contrôle (Facile)

source: Sandbox (Normal)
fr: Contrôle (Normale)

source: Sandbox (Hard)
fr: Contrôle (Difficile)

source: Easy
fr: Facile

source: Normal
fr: Normale

source: Hard
fr: Difficile

source: Total games played: %d
fr: Nombre de partie jouées : %d

source: Average score: %d
fr: Score moyen : %d

source: Average score: N/A
fr: Score moyen : N/A

source: Levels completed: %d
fr: Niveaux terminés : %d

source: Start Game
fr: Commencer une partie

source: Box-O'-Fun
fr: Boîte d'amusement

source: Box of Fun
fr: Boîte d'amusement

source: This is a set of three quite large levels created by Warren D. Ober.
fr: Ceci est un ensemble de trois grands niveaux créés par Warren D. Ober.

source: Here you will find some interesting use of pipes and other objects.
fr: Vous trouverez ici une utilisation intéressante de tuyaux et d'autres objets.

source: Hint: If you have difficult entering a pipe try to jump a little.
fr: Astuce: s'il est difficile d'entrer dans un tuyau, essayez de sauter un peu.

source: Castles
fr: Châteaux

source: Blue Castle
fr: Château blue

source: Do YOU dare to enter and brave these four castles? Only the most
fr: Oserez-vous d'entrer et de braver ces quatre châteaux? Seuls les joueurs

source: experienced and skilled Trackballs players will make it as far
fr: de Trackballs les plus expérimentés et les plus qualifiés atteindront

source: as to the thoughest Ice and Glass castle - a place where you may
fr: le plus fort château de glace et de verre - un endroit où vous devrez

source: need to think twice to find you way through the maze. Use the digits
fr: y réfléchir deux fois pour trouver votre chemin à travers le labyrinthe.

source: of PI as a clue in the last maze.
fr: Utilisez les chiffres de PI comme indice dans le dernier labyrinthe.

source: Child of Tales
fr: Enfant des contes

source: Maze
fr: Labyrinthe

source: This is an easy and short level for young children made by Attila
fr: C'est un niveau facile et court pour les jeunes enfants fabriqué par

source: Boros. It was created for my little goddaughter.
fr: Attila Boros. Il a été créé pour ma petite filleule.

source: The Con Tribe
fr: Le tribu des escrocs

source: Steep
fr: Escarpé

source: How do you stand up in the international tribe where no level
fr: Comment vous situez-vous dans la tribu internationale où aucun

source: is like the other? This is a collection of levels created by
fr: niveau est comme l'autre? Ceci est une collection de niveaux

source: different people all around the world. Enjoy!
fr: créés par différentes personnes dans le monde entier. Profitez!

source: Strange
fr: Bizarre

source: 1st Stranger
fr: 1er Étranger

source: A strange set of levels with a strange name -
fr: Un ensemble étrange de niveaux avec un nom étrange -

source: All made by Francek.
fr: Tous faits par Francek.

source: Don't stop
fr: À ne pas arrêter

source: Or stay still and see what happens!
fr: Ou restez immobile et voyez ce qui se passe!

source: Elite
fr: Élite

source: Castle
fr: Château

source: This is a single level set consiting of a huge level made
fr: Ceci est un ensemble de niveaux unique composé d'un énorme

source: by Dietrich Radel. This classic will go down in history like
fr: niveau réalisé par Dietrich Radel. Ce classique va dans l'histoire

source: "War and Peace". ;-)
fr: comme "Guerre et Paix". ;-)

source: The Four Seasons
fr: Les quatre saisons

source: Winter
fr: L'hiver

source: Play all year round! First comes the winter, then comes the...
fr: Jouez toute l'année! D'abord vient l'hiver, puis vient le ...

source: Great Escape
fr: La grande évasion

source: Prepare for the real Marble Madness-like adventure in this game!
fr: Préparez-vous à la vraie aventure comme Marble Madness dans ce jeu!

source: Race down one of the many hills, and beat the time limit and avoid
fr: Dévalez l'une des nombreuses collines, battez le délai et évitez les

source: badguys and hazards. Can you finish all the nine levels?
fr: méchants et les dangers. Pouvez-vous finir tous les neuf niveaux?

source: Made by: Ulrik Enstad.
fr: Réalisé par: Ulrik Enstad.

source: Jump
fr: Saut

source: Bridge
fr: Pont

source: A set of very difficult levels by Gerard Pudenz. Don't worry
fr: Un ensemble de niveaux très difficiles par Gerard Pudenz. Ne vous

source: if you can't make it on the first attempt. I promise, it can
fr: inquiétez pas si vous ne pouvez pas le faire à la première tentative.

source: be done eventually!
fr: Je promets que cela peut être fait éventuellement!

source: Kidz
fr: Gaminz

source: Right Angles
fr: Angles droits

source: This is meant to be a very easy and basic level for ages 4-5.
fr: Ceci est censé être un niveau très simple et basique pour les 4-5 ans.

source: Also, since I am a beginner at designing levels, I want to keep it
fr: En outre, puisque je suis un débutant à la conception des niveaux,

source: simple at first. Made by Keith Winston.
fr: je veux rester simple au début. Réalisé par Keith Winston.

source: A long way home
fr: Le long voyage

source: This is the original levelset for Trackballs containing
fr: Ceci est l'ensemble initial des niveaux pour Trackballs contenant

source: 9 levels of varying difficulty. It does not have any
fr: 9 niveaux de difficulté variable. Il n'a pas de thème

source: central theme and is meant to show most features of the game.
fr: central et est destiné à afficher la plupart des fonctionnalités du jeu.

source: By: Mathias Broxvall
fr: Par: Mathias Broxvall

source: Marble Mayhem
fr: Grabuge des marbres

source: Spyballs
fr: Les balles qui espionnent

source: A set of three skillfully made levels by Warren D Ober.
fr: Un ensemble de trois niveaux habilement fabriqués par Warren D Ober.

source: May the mayhem begin!
fr: Que le grabuge commence!

source: Pendulum Motion
fr: Mouvement pendulaire

source: Motion One
fr: Mouvement 1

source: This is a single level in a level set by Warren D. Ober.
fr: C'est un niveau unique par Warren D. Ober.

source: Be prepared for some fast paced action here.
fr: Préparez-vous à l'action rapide.

source: Six Levels
fr: Six niveaux

source: The Desert
fr: Le désert

source: "Six Levels" is, of course,
fr: "Six niveaux" est, bien sûr, un ensemble de niveaux

source: a level set containing six levels. Prepare to scale mountains,
fr: contenant six niveaux. Préparez-vous à étaler les montagnes,

source: kill bosses, roll through the world's longest pipe and
fr: à tuer les boss, à traverser le tuyau le plus long du monde et

source: much more. Can you beat all the six levels?
fr: bien plus encore. Pouvez-vous battre tous les six niveaux?

source: Made By Ulrik Enstad, ulrik.enstad@gmail.com
fr: Réalisé par Ulrik Enstad, ulrik.enstad@gmail.com

source: Bonus Level
fr: Niveau bonus

source: You made it to the end!
fr: Vous avez fini!

source: Spikes, 400pt
fr: Pointes, 400pt

source: Speed, 300pt
fr: Vitesse, 300pt

source: Jump, 200pt
fr: Saut, 200pt

source: Four Doors
fr: Quatre portes

source: 4 hidden switches open exit doors.
fr: 4 interrupteurs cachés ouvrent les portes de sortie.

source: A switch is nearby.
fr: Un interrupteur est à proximité.

source: Peace.
fr: Paix.

source: Azteca
fr: Aztèques

source: You have access to the complex.
fr: Vous avez accès au complexe.

source: The way is opened across the sand.
fr: La voie est ouverte sur le sable.

source: You must enter the Arena.
fr: Vous devez entrer dans l'Arène.

source: A wall has been lowered.
fr: Un mur a été abaissé.

source: A roof has been raised.
fr: Un toit a été élevé.

source: Stairs are in place.
fr: Les escaliers sont en place.

source: You may enter upper complex.
fr: Vous pouvez entrer dans le complexe supérieur.

source: The exit is now open.
fr: La sortie est ouverte.

source: Night Watch
fr: La veille de nuit

source: Stronghold
fr: Bastion

source: Ice and Glass
fr: Glace et verre

source: Maze of PI
fr: Labyrinthe de PI

source: Secret stairs somewhere
fr: Escalier secret quelque part

source: Christmas
fr: Noël

source: Pinky
fr: Rosâtre

source: Big Jump
fr: Grand saut

source: Wonderland
fr: Pays merveilleux

source: Pyramid
fr: Pyramide

source: Stairway to Heaven
fr: Escalier au paradis

source: Hell
fr: L'Enfer

source: Hell's entrance
fr: Entrée de l'enfer

source: Hell's gate
fr: Porte de l'enfer

source: Hell's castle
fr: Château de l'enfer

source: Hell's fire
fr: Le feu de l'enfer

source: Hell freezing over
fr: L'enfer gelant

source: Scary
fr: Effrayant

source: Mr. Black
fr: M. Black

source: Snowbord
fr: Snowboard

source: Strange indeed!
fr: Étrange en effet!

source: Water jumping
fr: Sauter sur l'eau

source: Oh my god!
fr: Mon Dieu!

source: Get wet!
fr: Mouillez!

source: Final and the last
fr: Finale et dernière

source: Switch twice
fr: Changer deux fois

source: Orbit
fr: Orbite

source: Castle of Darius the Mede
fr: Château de Darius le Mede
