Repository: trackballs/trackballs
Catalog: po/*.po
Languages: fr

source: Eternity
fr: Éternité

source: Spring
fr: Le printemps

source: Summer
fr: L'été

source: Remember to breathe
fr: Souvenez-vous de respirer

source: Autumn
fr: L'automne

source: Well done!
fr: Bravo!

source: Amazing! You won the entire game!
fr: Incroyable! Vous avez gagné tout le jeu!

source: Deja Vu
fr: Déjà vu

source: Towers of Heaven
fr: Tours du paradis

source: Blue
fr: Bleu

source: Upside Down
fr: À l'envers

source: High Nausea Rating
fr: Haute nausée

source: Jump'n Roll
fr: Sauter et rouler

source: Azure Fortress
fr: Forteresse d'azur

source: Ultimate
fr: Ultime

source: Chess Champion
fr: Champion d'échecs

source: Megajump
fr: Saut énorme

source: Upstairs
fr: En étage

source: Speedjump
fr: Saut de vitesse

source: Dangerous Jump
fr: Saut dangereux

source: At the Beach
fr: À la plage

source: Ice Skating Rink
fr: Patinoire

source: Clowning Around
fr: Faire le pitre

source: and his Minions
fr: et ses Larbins

source: Jump!
fr: Sautez!

source: Nightime
fr: Nuit

source: Labyrinth
fr: Labyrinthe

source: Cannon
fr: Canon

source: Crazy Factory
fr: Usine folle

source: Water world
fr: Monde de l'eau

source: Mayhem
fr: Grabuge

source: The Castle
fr: Le château

source: Stay on the path or else!
fr: Restez sur le chemin!

source: Speed-pill 2 minutes: 300 points
fr: Pilule de vitesse: 300 points

source: Extra Life: 800 points
fr: Vie supplémentaire: 800 points

source: Extra life: 800 points
fr: Vie supplémentaire: 800 points

source: Giant-package half a minute: 200 points
fr: Géant une demi minute: 200 points

source: Speed-pill one minute: 200 points
fr: Pilule de vitesse une minute: 200 points

source: Nitro-speed two minutes: 1000 points
fr: Vitesse nitro deux minutes: 1000 points

source: No jumping!
fr: Ne pas sauter!

source: Scale the Mountain
fr: Escalader la montagne

source: Kill me!
fr: Tuez-moi!

source: The Longest Pipe in the World
fr: La pipe la plus longue au monde

source: Smash some badguys and see what happens
fr: Écrasez des méchants et voyez ce qui se passe

source: Hurry up!
fr: Dépêchez-vous!

source: The Marble Mansion
fr: Le manoir de marbre

source: Pull twice
fr: Tirez deux fois

source: You may check out the roof again
fr: Vous pouvez vérifier le toit à nouveau

source: Oxygen
fr: Oxygène

source: The Marble HQ
fr: Le QG de marbre

source: The Marble HQ - Do not Enter!
fr: Le QG de marbe -- Ne pas entrer!

source: Commander's Hall
fr: Salle du commandant
